#! /bin/bash

#=====================================================================================================
#
#修改以下环境变量适合你的环境,其中：
#
#    EI_HOST_PORT                          EI业务融合服务器的机器的主服务端口  用来生成提示信息
#    EI_PORTS_OFFSET                       EI业务融合服务器的机器的端口偏移量，默认是0，控制台默认端口是9443，若偏移量设为1 ，则控制台端口是“默认端口+偏移量”，也就是9444. EI的其它端口也会一起偏移 
#
#======================================================================================================

EI_HOME=$1
EI_PORTS_OFFSET=$2
#-----------------------------------------------------------------------------------------------------
#检测环境变量
if [ -z "$EI_HOME" ]; then
  echo "EI_HOME 环境变量必须设置。"
  exit 1
fi

if [ -z "$EI_PORTS_OFFSET" ]; then
  EI_PORTS_OFFSET=0
fi

#-----------------------------------------------------------------------------------------------------
# 替换carbon.xml文件的配置
sed -i "s/<Offset>0</<Offset>$EI_PORTS_OFFSET</g" $EI_HOME/repository/conf/carbon.xml
#-----------------------------------------------------------------------------------------------------
# 转换编码
iconv -s -f ISO-8859-1 -t UTF-8 $EI_HOME/bin/integrator.sh  > /dev/null 2>&1
iconv -s -f ISO-8859-1 -t UTF-8 $EI_HOME/conf/carbon.xml > /dev/null 2>&1
#-----------------------------------------------------------------------------------------------------
# 去掉^M  也可以用dos2unix来转换，但dos2unix需要安装
# sed -i "s/\r//g"  $EI_HOME/bin/integrator.sh
find $EI_HOME/bin/  -name "*.sh" |xargs sed -i 's/\r//'